renesas/ra-fsp-examples/application_projects/r11an0497/example_projects_with_bootloader/ra6m4_swap_with_bootloader/ra_mcuboot_ra6m4/src/hal_entry.c
#include "hal_data.h"

FSP_CPP_HEADER
void R_BSP_WarmStart(bsp_warm_start_event_t event);
FSP_CPP_FOOTER
/* Use the following commands to sign the image, replacing ${ProjName}.elf with the path to your image elf file.
 * Regenerate this template if any MCUboot properties change in the bootloader project.
 Make the following updates to convert to binary, then sign image 1 (primary slot: 30000, secondary/upgrade slot: 20000):
 1. Update ${ProjName} to reflect the location of the image 1 .elf file
 2. Update ${workspace_loc:ra_mcuboot_ra6m4} to reflect the location of the root of the bootloader project
 arm-none-eabi-objcopy -O binary ${ProjName}.elf ${ProjName}.bin & python ${workspace_loc:ra_mcuboot_ra6m4}/ra/mcu-tools/MCUboot/scripts/imgtool.py sign -k ${workspace_loc:ra_mcuboot_ra6m4}/ra/mcu-tools/MCUboot/root-ec-p256.pem --version 1.0.0+0 --header-size 0x80 --align 128 --max-align 128 --slot-size 0x10000 --max-sectors 4  --confirm --pad-header ${ProjName}.bin ${ProjName}_signed.bin

 Make the following updates to convert to binary, then sign image 2 (primary slot: 40000, secondary/upgrade slot: 60000):
 1. Update ${ProjName} to reflect the location of the image 2 .elf file
 2. Update ${workspace_loc:ra_mcuboot_ra6m4} to reflect the location of the root of the bootloader project
 arm-none-eabi-objcopy -O binary ${ProjName}.elf ${ProjName}.bin & python ${workspace_loc:ra_mcuboot_ra6m4}/ra/mcu-tools/MCUboot/scripts/imgtool.py sign -k ${workspace_loc:ra_mcuboot_ra6m4}/ra/mcu-tools/MCUboot/root-ec-p256.pem --version 1.0.0+0 --header-size 0x80 --align 128 --max-align 128 --slot-size 0x20000 --max-sectors 4  --confirm --pad-header ${ProjName}.bin ${ProjName}_signed.bin
 */
/* Quick setup for MCUboot.
 *
 * To update the linker regions of an application to be used with this bootloader, add a the *.bld file created during the
 * build as a File property in e2 studio or RASC under Project > Properties, then C/C++ Build > Build Variables with variable
 * name BootloaderDataFile.
 */
void mcuboot_quick_setup()
{
#if defined(MCUBOOT_USE_MBED_TLS)
    /* Initialize mbedtls. */
    mbedtls_platform_context ctx = {0};
    assert(0 == mbedtls_platform_setup(&ctx));
#endif

    /* (Optional, not required if --pad is used during signing) To check for updates, call boot_set_pending. */
    bool update = 0;
    if (update)
    {
        boot_set_pending(0);
    }

    /* Verify the boot image and get its location. */
    struct boot_rsp rsp;
    assert(0 == boot_go(&rsp));

    /* Enter the application. */
    RM_MCUBOOT_PORT_BootApp(&rsp);
}

/*******************************************************************************************************************//**
 * main() is generated by the RA Configuration editor and is used to generate threads if an RTOS is used.  This function
 * is called by main() when no RTOS is used.
 **********************************************************************************************************************/
void hal_entry(void)
{
    mcuboot_quick_setup();

#if BSP_TZ_SECURE_BUILD
    /* Enter non-secure code */
    R_BSP_NonSecureEnter();
#endif
}

/*******************************************************************************************************************//**
 * This function is called at various points during the startup process.  This implementation uses the event that is
 * called right before main() to set up the pins.
 *
 * @param[in]  event    Where at in the start up process the code is currently at
 **********************************************************************************************************************/
void R_BSP_WarmStart(bsp_warm_start_event_t event)
{
    if (BSP_WARM_START_RESET == event)
    {
#if BSP_FEATURE_FLASH_LP_VERSION != 0

        /* Enable reading from data flash. */
        R_FACI_LP->DFLCTL = 1U;

        /* Would normally have to wait tDSTOP(6us) for data flash recovery. Placing the enable here, before clock and
         * C runtime initialization, should negate the need for a delay since the initialization will typically take more than 6us. */
#endif
    }

    if (BSP_WARM_START_POST_C == event)
    {
        /* C runtime environment and system clocks are setup. */

        /* Configure pins. */
        R_IOPORT_Open (&g_ioport_ctrl, &g_bsp_pin_cfg);
    }
}

#if BSP_TZ_SECURE_BUILD

BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ();

/* Trustzone Secure Projects require at least one nonsecure callable function in order to build (Remove this if it is not required to build). */
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ()
{

}
#endif
